class InsertInteriorComponents < ActiveRecord::Migration
  def up
    [{name: "головний зал", label: "60 персон", published: true, image_source: "main/interior1.jpg",
      description: "Привабливий інтер’єр та доброзичлива атмосфера чекають на Вас у ресторані &#171;Винний сад&#187;. Вишуканий дизайн, приємна музика та витончений смак улюбленого вина допоможуть Вам розслабитися та насолодитися добре проведеним часом в компанії друзів або наодинці з власними думками.",
     },
     {name: "літня тераса", label: "30 персон", published: true, image_source: "main/interior2.jpg",
      description: "На території &#171;Винного саду&#187; Ви маєте нагоду насолодитися свіжим повітрям, сонячним теплом, прекрасним краєвидом, ласуючи кулінарними шедеврами. Затишний інтер’єр тераси у стилі прованс поєднує в собі простоту, комфорт та ексклюзивність.",
     },
     {name: "&#171;vip&#187; &mdash; дегустаційний зал", label: "12 персон", published: true, image_source: "main/interior3.jpg",
      description: "Винарня &#171;Винний сад&#187; має власні дегустаційні зали, які інтригують своєю атмосферою і тішать шанувальників блискучою колекцією вин. Гості закладу мають змогу побувати на особливій дегустації в унікальній VIP-залі, яка вражає своєю неповторністю та розрахована на 12 осіб.",
     },
     {name: "&#171;комфорт&#187; - дегустаційний зал", label: "50 персон", published: true, image_source: "main/interior4.jpg",
      description: "Також є можливість проводити групові дегустації в комфортній залі, яка розміщена в старовинних печерах та може вмістити до 50 осіб одночасно. Неперевершена колекція вин. Вина власного виробництва. Казковий інтер’єр. Все це подарує Вам справжнє задоволення.",
     },
     { name: "дитячий майданчик", published: true, image_source: "main/interior5.jpg",
       description: "Запрошуємо наших маленьких гостей у цікаве та захоплююче місце для ігор та розваг. Професійні аніматори подбають про те, щоб Ваші діти отримали задоволення та яскраві емоції від розважальних програм та розвиваючих ігор. Перемістіться в захопливий світ пригод та фантазій разом з &#171;Винним садом&#187;.",
     }
    ].each do |hash|
      image_source = hash.delete(:image_source)
      record = InteriorComponent.new(hash)
      record.image = File.open(Rails.root.join("app/assets/images/#{image_source}"))
      record.save
    end
  end
end
